Revit 2024 API
DuctSettings Class
 The duct setting class.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DuctSettings : Element
Visual Basic
Public Class DuctSettings _
	Inherits Element
Visual C++
public ref class DuctSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.DuctSettings
See Also
DuctSettings Members
Autodesk.Revit.DB.Mechanical Namespace